ilove737/XS16_CH552T/src/CompositeKM.C

/********************************** (C) COPYRIGHT *******************************
* File Name          :CompositeKM.C
* Author             : WCH
* Version            : V1.2 
* Date               : 2018/02/28
* Description        : CH559模拟USB复合设备，键鼠，支持类命令,支持唤醒
*******************************************************************************/

#include "CH552.H"
// #include "UART1.H"
#include "Timer.H"
#include "Debug.H"
#include "scanKey.h"

#include "CompositeKM.H"
#include <string.h>
#include "FlashWrite.h"

#define Fullspeed
#define THIS_ENDP0_SIZE DEFAULT_ENDP0_SIZE

UINT8X __at (0x0000) Ep0Buffer[8 > (THIS_ENDP0_SIZE + 2) ? 8 : (THIS_ENDP0_SIZE + 2)];   //端点0 OUT&IN缓冲区，必须是偶地址
UINT8X __at (0x000a) Ep1Buffer[64 > (MAX_PACKET_SIZE + 2) ? 64 : (MAX_PACKET_SIZE + 2)]; //端点1 IN缓冲区,必须是偶地址
UINT8X __at (0x0050) Ep2Buffer[64 > (MAX_PACKET_SIZE + 2) ? 64 : (MAX_PACKET_SIZE + 2)]; //端点2 IN缓冲区,必须是偶地址
UINT8 SetupReq, Ready, Count, FLAG, UsbConfig;
UINT16 SetupLen;
PUINT8C pDescr;             //USB配置标志
USB_SETUP_REQ SetupReqBuf; //暂存Setup包

UINT8X __at (0x0160) KeymapBuf[KEYMAP_BYTES + 1];   // 480 字节数据 + 1 Report ID 位 = 481
volatile UINT8 keymapRxPending;  // 1=正在接收键位数据
volatile UINT16 keymapRxOffset;  // 已接收字节数（含 Report ID 位，从 1 起始，最大 481）
volatile UINT8 keymapSkipId;     // 1=数据阶段首字节为 Report ID，需跳过

// 应用场景下行：走 SetReport 控制传输（EP0，wValue=0x0202）
volatile UINT8 sceneCmdPending;

// 当前应用场景 ID（由 EP0 SET_REPORT 控制传输接收更新，scanKey.c 据此选择 keyMap）
volatile UINT8 currentScene;
// sbit Ep2InKey = P1 ^ 5;
__sbit __at (0xB5) CapsLED;

#define UsbSetupBuf ((PUSB_SETUP_REQ)Ep0Buffer)
#define DEBUG 0
// #pragma NOAREGS  // SDCC may not support this pragma
/*设备描述符*/
UINT8C DevDesc[18] = {0x12, 0x01, 0x10, 0x01, 0x00, 0x00, 0x00, THIS_ENDP0_SIZE,
                      0x58, 0x4c, 0x10, 0x53, 0x00, 0x00, 0x01, 0x03,
                      0x00, 0x01};
UINT8C CfgDesc[84] =
    {
        0x09, 0x02, 0x4D, 0x00, 0x03, 0x01, 0x00, 0xA0, 0x32, //配置描述符（77 字节，3 个接口）
        0x09, 0x04, 0x00, 0x00, 0x01, 0x03, 0x01, 0x01, 0x00, //接口描述符,键盘 IF0
        0x09, 0x21, 0x11, 0x01, 0x00, 0x01, 0x22, 0x54, 0x00, //HID类描述符 (报表描述符 84 字节)
        0x07, 0x05, 0x81, 0x03, 0x08, 0x00, 0x0a,             //端点描述符 1IN
        0x09, 0x04, 0x01, 0x00, 0x01, 0x03, 0x01, 0x02, 0x00, //接口描述符,鼠标 IF1
        0x09, 0x21, 0x10, 0x01, 0x00, 0x01, 0x22, 0x34, 0x00, //HID类描述符
        0x07, 0x05, 0x82, 0x03, 0x04, 0x00, 0x0a,             //端点描述符 2IN
        0x09, 0x04, 0x02, 0x00, 0x00, 0xFF, 0x00, 0x00, 0x00, //接口描述符,厂商自定义 IF2（应用场景下行，仅 SET_REPORT，无中断端点；class 改 0xFF 避免内核 usbhid 绑定报 warning）
        0x09, 0x21, 0x00, 0x01, 0x00, 0x01, 0x22, 0x15, 0x00, //HID类描述符 (报表描述符 21 字节)
};

UINT8C MyProductIDInfo[] = {0x1c,0x03,'X',0,'S',0,'1',0,'6',0,' ',0,'K',0,'e',0,'y',0,'b',0,'o',0,'a',0,'r',0,'d',0}; // 产品信息字符串描述符
/* 语言描述符 */
UINT8C MyLangDescr[ ] = { 0x04, 0x03, 0x09, 0x04 };
/* 厂家信息 */
UINT8C MyManuInfo[ ] = { 0x0C, 0x03, 'N', 0, 'i', 0, 'u', 0, 'e', 0, 'r', 0 };
/* 产品信息 */
UINT8C MyProdInfo[ ] = { 0x0C, 0x03, 'C', 0, 'H', 0, '5', 0, '5', 0, '2', 0 };

/*字符串描述符*/
/*HID类报表描述符*/
UINT8C KeyRepDesc[84] =
    {
        0x05, 0x01, 0x09, 0x06, 0xA1, 0x01, 0x05, 0x07,
        0x19, 0xe0, 0x29, 0xe7, 0x15, 0x00, 0x25, 0x01,
        0x75, 0x01, 0x95, 0x08, 0x81, 0x02, 0x95, 0x01,
        0x75, 0x08, 0x81, 0x01, 0x95, 0x03, 0x75, 0x01,
        0x05, 0x08, 0x19, 0x01, 0x29, 0x03, 0x91, 0x02,
        0x95, 0x05, 0x75, 0x01, 0x91, 0x01, 0x95, 0x06,
        0x75, 0x08, 0x26, 0xff, 0x00, 0x05, 0x07, 0x19,
        0x00, 0x29, 0x91, 0x81, 0x00, 
        // 厂商自定义 Feature 报告（键位映射读写，Report ID = 1）
        0xA1, 0x01,              // Collection (Application)
        0x85, 0x01,              //   Report ID (1)
        0x06, 0x00, 0xff,        //   Usage Page (Vendor Defined 0xFF00)
        0x09, 0x01,              //   Usage (1)
        0x15, 0x00,              //   Logical Minimum (0)
        0x26, 0xff, 0x00,        //   Logical Maximum (255)
        0x75, 0x08,              //   Report Size (8)
        0x96, 0xE0, 0x01,        //   Report Count (480 = 0x1E0)
        0xb1, 0x02,              //   Feature (Data,Var,Abs)
        0xC0, 0xC0               // End Collection
    };
UINT8C MouseRepDesc[52] =
    {
        0x05, 0x01, 0x09, 0x02, 0xA1, 0x01, 0x09, 0x01,
        0xA1, 0x00, 0x05, 0x09, 0x19, 0x01, 0x29, 0x03,
        0x15, 0x00, 0x25, 0x01, 0x75, 0x01, 0x95, 0x03,
        0x81, 0x02, 0x75, 0x05, 0x95, 0x01, 0x81, 0x01,
        0x05, 0x01, 0x09, 0x30, 0x09, 0x31, 0x09, 0x38,
        0x15, 0x81, 0x25, 0x7f, 0x75, 0x08, 0x95, 0x03,
        0x81, 0x06, 0xC0, 0xC0};
/* 厂商自定义 Output 报告（应用场景下行，Report ID = 2）
 * 主机通过 EP0 SET_REPORT 控制传输下发，不占用中断 OUT 端点。
 * 数据：[0]=ReportID(0x02) [1]=SCENE_CMD_MAGIC(0x5C) [2]=场景ID [3..7]=0 */
UINT8C VendorRepDesc[21] =
    {
        0xA1, 0x01,              // Collection (Application)
        0x85, 0x02,              //   Report ID (2)
        0x06, 0x00, 0xff,        //   Usage Page (Vendor Defined 0xFF00)
        0x09, 0x02,              //   Usage (2)
        0x15, 0x00,              //   Logical Minimum (0)
        0x26, 0xff, 0x00,        //   Logical Maximum (255)
        0x75, 0x08,              //   Report Size (8)
        0x95, 0x08,              //   Report Count (8)
        0x91, 0x02,              //   Output (Data,Var,Abs)
        0xC0                     // End Collection
    };
/*鼠标数据*/
UINT8 HIDMouse[4] = {0x0, 0x0, 0x0, 0x0};
/*键盘数据*/
extern UINT8 HIDKey[8] = {0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0};

/*******************************************************************************
* Function Name  : USBDeviceInit()
* Description    : USB设备模式配置,设备模式启动，收发端点配置，中断开启
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USBDeviceInit(void)
{
    IE_USB = 0;
    USB_CTRL = 0x00;        // 先设定USB设备模式
    UDEV_CTRL = bUD_PD_DIS; // 禁止DP/DM下拉电阻
#ifndef Fullspeed
    UDEV_CTRL |= bUD_LOW_SPEED; //选择低速1.5M模式
    USB_CTRL |= bUC_LOW_SPEED;
#else
    UDEV_CTRL &= ~bUD_LOW_SPEED; //选择全速12M模式，默认方式
    USB_CTRL &= ~bUC_LOW_SPEED;
#endif

    UEP2_DMA = (UINT16)Ep2Buffer;                           //端点2数据传输地址
    UEP2_3_MOD = UEP2_3_MOD & ~bUEP2_BUF_MOD | bUEP2_TX_EN; //端点2发送使能 64字节缓冲区
    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;              //端点2自动翻转同步标志位，IN事务返回NAK
    UEP0_DMA = (UINT16)Ep0Buffer;                           //端点0数据传输地址
    UEP4_1_MOD &= ~(bUEP4_RX_EN | bUEP4_TX_EN);             //端点0单64字节收发缓冲区
    UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;              //OUT事务返回ACK，IN事务返回NAK
    UEP1_DMA = (UINT16)Ep1Buffer;                           //端点1数据传输地址
    UEP4_1_MOD = UEP4_1_MOD & ~bUEP1_BUF_MOD | bUEP1_TX_EN; //端点1发送使能 64字节缓冲区
    UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;              //端点1自动翻转同步标志位，IN事务返回NAK

